{
    "id": "conservatory_op_intel_aars",
    "authorId": "GhostReconActual",
    "title": "Conservatory Op - Intel & AARs",
    "body": "Alright team, let's debrief the Conservatory Hostage Situation. My run was clean, but tricky.\n\n* **Entry:** Slipped in through a busted pane in the dome, just like intel suggested. Pro-tip: watch for loose shards, almost gave myself away.  \n* **Movement:** Stayed high, used the hanging gardens and big palm fronds for cover. The misting system kicked in at one point – perfect for a quick dash across an open space.  \n* **Target:** The rogue security bot (looked like a modified K-9 unit, anyone else confirm?) was doing a pretty predictable patrol around that central fountain. The \"specimen\" – a small, glowing Flora-class AI, looked like – was tucked away near some pitcher plants. Seemed unharmed, just scared.  \n* **Extraction:** Found an unlocked maintenance door on the north side, behind a row of overgrown ferns. Much quieter than going back out the roof.\n\nAnyone else have a different experience? Heard some chatter about a rival drone being the captor for some of you?",
    "likes": 0,
    "dislikes": 0,
    "comments": [
        {
            "id": "comment_1",
            "authorId": "ShadowStalker7",
            "body": "RE: Conservatory Op \\- Intel & AARs\n\nYeah, @GhostReconActual, my intel said rival corp drone, not a standard sec-bot. Looked like one of those new Ares Skitter-types. More erratic patrol pattern, made observation a real pain.\n\nSmashed a garden gnome by accident when I had to make a sudden dive under a bench. Oops. Hope that doesn't come out of my pay.\n\nThe \"hostage\" in my instance was definitely a bio-specimen, some kind of rare orchid. Had to be real careful not to trigger any of its defense mechanisms when I got close for the scan. The air was thick with pollen.\n\nI used the same roof entry but extracted through a large, open bay window on the west side. Risky, but faster. The humidifiers were a godsend."
        },
        {
            "id": "comment_2",
            "authorId": "VineSniper",
            "body": "RE: Conservatory Op \\- Intel & AARs\n\nMy run was a bit hairy. The \"captor\" was definitely a beefed-up security bot, heavy armor. It wasn't just patrolling the fountain; it was actively scanning the upper levels. Had to hug the trellises like I was part of the ivy.\n\nThe \"specimen\" (Flora-AI for me too) was right out in the open by the fountain, not hidden at all. Seemed like a trap.\n\nFound a cracked pane near the floor on the east side for my exfil. Had to time it with the bot's patrol. Those wrought-iron benches make a surprising amount of noise if you bump them.\n\nAnyone else notice the half-eaten sandwich on one of the tables? Guess the bot got hungry. Or maybe it was the previous \"owner\" of the specimen."
        },
        {
            "id": "comment_3",
            "authorId": "NoobOperator101",
            "body": "RE: Conservatory Op \\- Intel & AARs\n\nHow are you guys getting in so quietly?! I tried the roof panel and ended up falling straight through a weak spot onto a pile of gardening tools. Made enough noise to wake the dead. The bot was on me in seconds. Mission failed. :(\n\nAny tips for a beginner on stealth movement in those kinds of environments? The hanging plants kept snagging my gear."
        },
        {
            "id": "comment_4",
            "authorId": "FloraFanatic",
            "body": "RE: Conservatory Op \\- Intel & AARs\n\nForget the mission, did anyone get a good look at that *Amorphophallus titanum* near the south entrance? Absolutely magnificent bloom! And was that a *Nepenthes attenboroughii* by the fountain? I'd risk a rogue drone encounter just to get a cutting.\n\nThe \"specimen\" in my op was a data chip cleverly disguised within a synthetic Venus Flytrap. The drone holding it hostage was one of those annoying little quad-rotor types, zipping all over. Had to use the misting system to short it out temporarily to grab the chip. Extracted through a ventilation shaft I found behind a large Ficus tree."
        }
    ]
}