{
    "id": "master_suite_ied_scan",
    "authorId": "NoobSlayer42",
    "title": "Anyone else getting blown up by that CLOCK?\\!",
    "body": "OMG, this level is impossible\\! I swear I've scanned everything. The wardrobe, under the bed, even the fancy toilet. But that stupid antique clock on the mantelpiece gets me EVERY. SINGLE. TIME. Is it bugged? Or am I just missing something super obvious? My drone is now a pile of expensive confetti. Halp\\!",
    "likes": 0,
    "dislikes": 0,
    "comments": [
        {
            "id": "comment_1",
            "authorId": "EagleEyeActual",
            "body": "**NoobSlayer42 wrote:** OMG, this level is impossible\\! I swear I've scanned everything...\n\nHey NoobSlayer42,\nIt's not bugged, but it's definitely tricky. The clock is the key, you're right on that. You need to be really careful with your approach. Don't just fly straight at it. Think about the \"suspiciously modified\" part of the briefing. Are there any visual cues? Is one part of it different? Also, check your scan distance. Too close too fast, and boom.\nP.S. The bathtub is a decoy. Don't waste too much time there unless you're admiring the marble."
        },
        {
            "id": "comment_2",
            "authorId": "StealthySaboteur",
            "body": "Just finished the Master Suite scan. My heart is still pounding. That low flight under the (potential) motion sensors in the main bedroom was intense. I almost clipped a drape on the four-poster bed.\nMy advice:\n\n* **Bathroom Entry:** Easy enough, but don't get complacent.\n* **Low & Slow:** Seriously, take your time in the bedroom. No sudden movements.\n* **Wardrobe:** Check the base *and* any drawers that look even slightly ajar. I found a pressure plate simulant near one.\n* **Vanity:** The space underneath is tighter than it looks. Good place for a tripwire analogue.\n* **The Clock:** As others have said, this is the main event. Approach with extreme caution. Scan from multiple angles if you can.\n* **Dressing Room Exit:** Don't relax until you're clear out the window. Intel said *a* device, not *only one*.\n\nGood luck, operators. This one tests your patience."
        },
        {
            "id": "comment_3",
            "authorId": "GadgetGeekGal",
            "body": "Okay, so, about that \"suspiciously modified\" antique clock...\nWithout giving too much away (because figuring it out is part of the fun/frustration\\!), has anyone else noticed the slight discoloration on one of the side panels? Or the fact that one of the roman numerals on the face seems a tiny bit thicker than the others?\nJust sayin'. Details, people, details\\! This isn't just about flying a drone; it's about observation. The environmental storytelling in this level is top-notch, even if it makes me want to throw my controller. Also, the opulence is almost distracting. I spent a good minute just looking at the pattern on the ornate rug."
        },
        {
            "id": "comment_4",
            "authorId": "SpeedRunnerPro",
            "body": "Master Suite IED Scan - Personal Best: 2:17.\nPath: Window > Bathroom (minimal scan) > Bedroom (direct to bed, quick scan under) > Wardrobe (base scan only) > Clock (direct, precise scan) > Dressing Room > Exit.\nThe motion sensors are a bluff if you maintain a specific altitude. The clock is all about hitting the scan sweet spot immediately. No wasted movements. Anyone beat my time?"
        },
        {
            "id": "comment_5",
            "authorId": "JustHereForTheLore",
            "body": "Can we just appreciate the setting for this level? The \"opulent master suite\" really paints a picture. Makes you wonder who lives (or lived?) there and why they'd be a target for such a sophisticated IED. The antique clock, the four-poster bed... it feels very personal. The intel about a \"sabotaged device\" is so vague too. Adds to the mystery\\!\nI know it's a sim, but the atmosphere in this one is creepy. Especially thinking about what could happen if you miss something."
        }
    ]
}