{
    "id": "multi_room_transit_headaches",
    "authorId": "Maverick_Actual",
    "title": "Multi-Room Transit Headaches",
    "body": "Is anyone else finding the \"Master Suite IED Scan\" scenario an absolute beast for maintaining orientation? Going from the bathroom, over that slick Marble Table that messes with the altimeter, then squeezing into the bedroom, only to navigate another doorway into the dressing room... I swear I spend half the time just trying to remember which way is \"out.\" Lost a bird yesterday because I clipped a doorframe trying to back out of the bedroom too quickly.",
    "likes": 0,
    "dislikes": 0,
    "comments": [
        {
            "id": "c1",
            "authorId": "EchoSeven",
            "body": "Maverick_Actual wrote:\nIs anyone else finding the \"Master Suite IED Scan\" scenario an absolute beast for maintaining orientation?\n\n100% agree. The transition from the bright bathroom to the dimmer bedroom, then into that cluttered dressing room is a sensory overload for the drone's optics. My depth perception goes completely out the window trying to judge the second and third doorways in quick succession. And don't get me started on the ceiling Fan in the bedroom – the sim models its downwash, and it's just enough to throw you off course when you're trying to line up for the dressing room door."
        },
        {
            "id": "c2",
            "authorId": "PinPointPilot",
            "body": "That Master Suite run is tough. My big fail was in the dressing room. I'd made it through the bathroom and bedroom, feeling pretty good. Then, while trying to scan near a wardrobe, I backed up a little too far and got tangled with a Wooden Chair tucked under a small vanity. The space is so much tighter in there than the bedroom. Tried to recover, but ended up in a spin. The constant doorway transitions really test your spatial awareness. I also nearly took out a Toy TU95 Model Plane that was perched on a shelf right next to the doorway into the dressing room – almost invisible on approach."
        },
        {
            "id": "c3",
            "authorId": "Maverick_Actual",
            "body": "PinPointPilot wrote:\nI also nearly took out a Toy TU95 Model Plane that was perched on a shelf right next to the doorway into the dressing room – almost invisible on approach.\n\nThat little plane! Almost got me too. It's the accumulation of small obstacles and tight transitions. By the time I'm in the third room, my battery is usually screaming, and the pressure to find the \"device\" and get out ramps up. Signal degradation also seems to be a factor the deeper you go."
        },
        {
            "id": "c4",
            "authorId": "SimTester_03",
            "body": "Operators, the \"Master Suite IED Scan\" (MS-IS-01) is specifically designed to test sustained precision flight and situational awareness across multiple interconnected, and increasingly complex, spaces.\n\nThe varying light conditions, environmental factors like the ceiling Fan, and the density of objects like the Marble Table, Wooden Chair, and even the Toy TU95 Model Plane are all part of the challenge. We're also simulating progressive signal attenuation the further you are from the insertion point.\n\nYour feedback on orientation difficulties and specific obstacle interactions is invaluable. We're analyzing the telemetry to see if any particular transitions are disproportionately difficult versus the intended learning curve.\n\nKeep those AARs coming!"
        },
        {
            "id": "c5",
            "authorId": "EchoSeven",
            "body": "Good to know the pain is intentional, SimTester_03! Maybe an option for a breadcrumb trail on the HUD for multi-room scenarios? Or at least a clearer exit vector indicator once an objective in a deep room is met. That ceiling Fan is a menace when you're already stressed."
        }
    ]
}