{
    "id": "post_table_navigation_issues",
    "authorId": "DroneOp_Alpha",
    "title": "Table Navigation Issues",
    "body": "Alright, who else got absolutely humbled by the \"Grand Library\" scenario, specifically the objective requiring intel from *under* that massive **Wooden Table** in the main reading room? My bird (simulated, thankfully) nearly became a permanent fixture down there. The clearance looked okay on approach, but once you're committed, it's a different ball game.",
    "likes": 0,
    "dislikes": 0,
    "comments": [
        {
            "id": "comment1",
            "authorId": "Nightjar7",
            "body": "DroneOp\\_Alpha wrote:\nAlright, who else got absolutely humbled by the \"Grand Library\" scenario, specifically the objective requiring intel from under that massive Wooden Table in the main reading room?\n\nTell me about it\\! Lost two simulated units there yesterday. The downwash in that confined space was brutal. My depth perception on the feed went haywire trying to judge the distance to the table legs and the floor simultaneously. It's one thing to clear a doorway, quite another to skim a few inches off the ground *under* something that solid."
        },
        {
            "id": "comment2",
            "authorId": "Spotter_Mukhya",
            "body": "Seconded. That wasn't just any **Wooden Table**; it was one of those antique behemoths with the thick, carved legs. Felt like threading a needle in a wind tunnel. My biggest scare was nearly clipping that old **Radio** someone thought was a good idea to place on the floor near the far leg. The objective marker was practically *on* it. One wrong twitch and I'd have failed the \"avoid collateral damage\" sub-objective for sure. The proximity sensors were screaming."
        },
        {
            "id": "comment3",
            "authorId": "DroneOp_Alpha",
            "body": "Spotter\\_Mukhya wrote:\nMy biggest scare was nearly clipping that old Radio someone thought was a good idea to place on the floor near the far leg.\n\nExactly\\! And the lighting under there... or lack thereof. My optical sensors struggled with the dark wood underside of the table. The LIDAR was a bit better, but the refresh rate felt sluggish when making micro-adjustments. I also had a close call with a **Wooden Chair** that was pushed in just enough to be an unexpected obstacle on my exit path. Had to do a very sketchy lateral drift to clear it."
        },
        {
            "id": "comment4",
            "authorId": "SimTester_03",
            "body": "Appreciate the feedback, operators. The \"Grand Library\" table navigation is indeed a high-difficulty maneuver designed to test precision control in cluttered, GPS-denied environments.\n\nWe're looking into the sensor modeling, especially regarding performance with dark, non-reflective surfaces like the underside of that particular **Wooden Table**. The placement of the **Radio** and the **Wooden Chair** are intentional elements to increase complexity and mimic real-world unpredictable object placement.\n\nKeep the AARs coming. This is valuable data for refinement."
        },
        {
            "id": "comment5",
            "authorId": "Nightjar7",
            "body": "Good to know it's being looked at, SimTester\\_03. Maybe a dedicated \"low-clearance\" flight mode overlay for the HUD? Or enhanced audio cues from the proximity sensors for sub-centimeter distances?\n\nThat **Wooden Chair** almost got me too. Had to crab-walk the drone out sideways, rotors screaming. Not exactly stealthy."
        }
    ]
}