{
  "id": "wine_cellar",
  "authorId": "Viper_Actual",
  "title": "Anyone else get spooked in the Baron's wine cellar?",
  "body": "Man, that wine cellar op was something else. Intel said \"dusty,\" not \"actively trying to collapse on you.\" Seriously, who keeps that much vintage grape juice in a place that structurally sound as a wet paper bag?\n\nEntered through the pantry vent like a rat – not my most dignified infiltration. The tunnels are TIGHT. Had to practically scrape the drone along the bricks, and don't even get me started on the cobwebs. My LiDAR was going nuts.\n\nThose wine racks... one wrong nudge and I swear the whole row would've come down. Saw a couple of sections that looked like they were held together by willpower and ancient spider silk. Anyone else nearly lose their bird to a wobbly Merlot display?\n\nFound the \"vintage\" – nice little hidden alcove behind some surprisingly well-stocked (but fake) shelves. Clever. The real prize though was that crumbling wall leading to the old service tunnel. That's a game-changer for exfil if things go loud upstairs.\n\nAnyone map any other weak points? I tagged a few sketchy-looking archways.",
  "likes": 0,
  "dislikes": 0,
  "comments": [
    {
      "id": "comment001",
      "authorId": "Ghost_Pilot_7",
      "body": "Viper Actual wrote:  \nMan, that wine cellar op was something else...\n\nTell me about it\\! My night vision was flickering more than those ancient light fixtures down there. Half the time I was flying blind, relying on sonar pings off those barrels and the sound of dripping water.\n\nThe low-hanging pipes were a nightmare. Clipped one with my rotor guard, nearly sent me into a pile of broken bottles. Good thing the drone's got that reinforced casing.\n\nDid you notice the old tools just lying around? Looked like someone just dropped them and ran. Creepy.\n\nThe hidden alcove was a nice touch. Almost missed it. My scanner picked up a density change behind the bottles. The \"vintage\" was exactly where they said it would be, thankfully. That service tunnel exit was a godsend. Much better than trying to climb back out that tiny vent with hostiles potentially swarming the kitchen."
    },
    {
      "id": "comment002",
      "authorId": "CellarDweller99",
      "body": "You guys are complaining? That was the most fun I've had all week! It was like a maze designed by a tipsy architect.\n\nThe uneven floors were a bit tricky, especially with those random puddles. Had to keep the altitude just right. And yeah, those rickety wine racks are no joke. I actually *did* knock over a small one. Oops. Hope it wasn't anything *too* expensive. (It was probably vinegar by now anyway, right?)\n\nThe best part was finding that crumbling wall. I almost didn't check it, thought it was just more loose bricks. But the draft coming through was a giveaway. That service tunnel is a sweet find. Bet the Baron doesn't even know it's there.\n\nAnyone else spot the old electrical conduits sparking intermittently? Adds to the ambiance, I guess. Or a major fire hazard. Potato, potahto."
    },
    {
      "id": "comment003",
      "authorId": "Recon_Rico",
      "body": "CellarDweller99 wrote:  \nYou guys are complaining? That was the most fun I've had all week\\!\n\nEasy for you to say, you probably *enjoy* crawling through tight, dark spaces.\n\nMy main takeaway: structural integrity is NOT a priority for these old-money types when it comes to their booze basements. I mapped at least three sections where a well-placed charge would bring a significant portion of the ceiling down. Not that we *would*, but good to know.\n\nThe ventilation grate entry was a classic. Dusty, but effective. The transition from narrow brick tunnels to slightly wider sections with the wine racks felt like going from a burrow to a slightly larger burrow.\n\nThe target vintage was in a surprisingly obvious \"hidden\" spot once you knew what to look for. The false wall was almost *too* neat. The alternate exit through the crumbling wall, though? Pure gold. That's the kind of intel that saves missions.\n\nWatch out for loose stones on the floor if you're going back in. Almost got my drone's landing gear snagged."
    }
  ]
}
